

module.exports = {

  // 模拟数据，需要指明
  '/api/*': {
        // target: 'http://192.168.8.101:8021',
    //  target: 'http://192.168.146.198:8021',
     target: 'http://127.0.0.1:2618', // mock
    //  target: 'http://127.0.0.1:8021', // 本机后端服务
        // target:'http://172.16.251.218:8021', // v2.0测试环境
    //  target:'http://10.148.160.133:8091', //测试环境
    //  target: 'http://10.148.160.133:8092',  // 开发环境
    //   target: 'http://192.168.145.160:8101', //王昊
    //   target: 'http://192.168.146.93:8021', //张成

    //   target: 'http://192.168.147.30:8021',
    //  target: 'http://192.168.8.112:8021',//黄凤祥
    //    target: 'http://192.168.8.107:8021',//林
    //  target: 'http://192.168.8.111:8021',//谢凯豪
    //    target: 'http://192.168.8.133:8021',//测试
    // target: 'http://192.168.8.113:8021',//王钊
      secure: false,
    pathRewrite: { '^/api': '' }
  },
  // '/api/*': {
  // 	target: 'http://127.0.0.1:2618',
  // 	secure: false,
  // 	pathRewrite: { '^/api': '' }
  // },
};

